#include "script_component.hpp"

LOG("[Resistance] | INFO | %1 Started");

/*
 ████████╗███████╗    ██████╗  █████╗ ██████╗ ██╗ ██████╗
 ╚══██╔══╝██╔════╝    ██╔══██╗██╔══██╗██╔══██╗██║██╔═══██╗
    ██║   █████╗      ██████╔╝███████║██║  ██║██║██║   ██║
    ██║   ██╔══╝      ██╔══██╗██╔══██║██║  ██║██║██║   ██║
    ██║   ██║         ██║  ██║██║  ██║██████╔╝██║╚██████╔╝
    ╚═╝   ╚═╝         ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝ ╚═╝ ╚═════╝
*/

if (hasInterface) then {
	tf_radio_channel_name = "TaskForceRadio#1";
	tf_radio_channel_password = "2018";
};

/*
 ██████╗ ███████╗███████╗██████╗  █████╗ ██╗    ██╗███╗   ██╗
 ██╔══██╗██╔════╝██╔════╝██╔══██╗██╔══██╗██║    ██║████╗  ██║
 ██████╔╝█████╗  ███████╗██████╔╝███████║██║ █╗ ██║██╔██╗ ██║
 ██╔══██╗██╔══╝  ╚════██║██╔═══╝ ██╔══██║██║███╗██║██║╚██╗██║
 ██║  ██║███████╗███████║██║     ██║  ██║╚███╔███╔╝██║ ╚████║
 ╚═╝  ╚═╝╚══════╝╚══════╝╚═╝     ╚═╝  ╚═╝ ╚══╝╚══╝ ╚═╝  ╚═══╝
*/

waitUntil { Sleep 0.1; if (Local Player) exitWith {true}; false};

[east, "Medic"] call BIS_fnc_addRespawnInventory;
[east, "Engineer"] call BIS_fnc_addRespawnInventory;
[east, "Assault1"] call BIS_fnc_addRespawnInventory;
[east, "Assault2"] call BIS_fnc_addRespawnInventory;

LOG("[Resistance] | INFO | %1 Finished");
